#------------------增-------------------------

#定义一个列表
names=["1","2","3","4"]
print(names)
#使用append加入一个数据到原来的列表的最后
names.append("5")
print(names)
#或者使用insert添加内容
names.insert(2,"FBI")
print(names)
#################上面的运行效果如下###############################
#    ['1', '2', '3', '4']
#    ['1', '2', '3', '4', '5']
#    ['1', '2', 'FBI', '3', '4', '5']
names2=["6","7","8","9"]
names3=names+names2
print(names3)
names.extend(names2)
print(names)
#################上面的运行效果如下###############################
#    ['1', '2', 'FBI', '3', '4', '5', '6', '7', '8', '9']
#    ['1', '2', 'FBI', '3', '4', '5', '6', '7', '8', '9']

#------------------删-------------------------

#使用的pop删除
names.pop()  #()中可以填写数字
print(names)
#使用的remove删除
names.remove("3")
print(names)
#使用的del删除
del names[0]
print(names)

#------------------改-------------------------
names[0]="00"
print(names)

#------------------查-------------------------
if "5" in names:
    print("I find you ")
